##  Create Pandas series

* Seriler Numpy dizileri baz alınarak oluşturulmuştur.
* Dolayısıyla tek boyutlu Numpy dizilerine çok benzerler.

* https://medium.com/deep-learning-turkiye/adan-z-ye-pandas-tutoriali-ba%C5%9Flang%C4%B1%C3%A7-ve-orta-seviye-4edf0094e0d5
* https://www.veribilimiokulu.com/blog/python-pandas-ile-temel-islemler/

* https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html

In [37]:
import numpy as np
import pandas as pd

In [38]:
numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
numpy_array = np.array(numbers)
print(numpy_array)

[0 1 2 3 4 5 6 7 8 9]

In [39]:
pandas_series = pd.Series(data=numbers)
print(pandas_series)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [40]:
dict=pd.Series({"reg":10,"log":11,"cart":12})

In [41]:
dict

reg     10
log     11
cart    12
dtype: int64

In [42]:
type(dict)

pandas.core.series.Series

In [43]:
dictsample=pd.Series(dict)

In [44]:
## CONCANAtATION
pd.concat ([dict,dict])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

In [45]:
import numpy as np
import pandas as pd

In [46]:
## ELEMENT OPERATION
a =np.array([1,2,33,44,55])
series =pd.Series(a)
series

0     1
1     2
2    33
3    44
4    55
dtype: int32

In [47]:
series[0]

1

In [48]:
series[0:3]

0     1
1     2
2    33
dtype: int32

In [49]:
series =pd.Series([121,200,150,99],index =["reg","log","cart","rf"])

In [50]:
series

reg     121
log     200
cart    150
rf       99
dtype: int64

In [51]:
series.index

Index(['reg', 'log', 'cart', 'rf'], dtype='object')

In [52]:
series.keys

<bound method Series.keys of reg     121
log     200
cart    150
rf       99
dtype: int64>

In [53]:
list(series.items())

[('reg', 121), ('log', 200), ('cart', 150), ('rf', 99)]

In [54]:
series.values

array([121, 200, 150,  99], dtype=int64)

## Element Query

In [55]:
"reg" in series

True

In [56]:
"a" in series

False

In [57]:
series["reg"]

121

## Fancy Element

In [58]:
series[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [59]:
series["reg"]=131

In [60]:
series["reg"]

131

In [61]:
series["reg":"log"]

reg    131
log    200
dtype: int64

# Numpy dizisinden farklı olarak serilerde index sütunu da bulunur. İndex sütunu belirtilmediği takdirde default olarak n uzunlukta bir dizi için 0'dan başlayıp 1,2,… şeklinde (n-1)’e kadar devam eden bir dizi olur.

In [62]:
my_index = ['a', 'b', 'c', 'd', 'e', 'f', 'g','h', 'i','j']
pandas_series = pd.Series(data=numbers, index=my_index, dtype=float)
print(pandas_series)

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
g    6.0
h    7.0
i    8.0
j    9.0
dtype: float64

In [63]:
numbers_dictionary = {'a': 0, 'b':1, 'c':2, 'd':3, 'e':4, 'f':5, 'g':6,'h':7, 'i':8,'j':9}
pandas_series = pd.Series(data=numbers_dictionary)
print(pandas_series)

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int64

##  Serinin data parametresi bir dictionary olduğunda ‘key’ kısımlarının index olarak kullanabiliriz
* Seriler Numpy dizilerine çok benzer.
* Bu sebeple Numpy dizilerine ait bir çok fonksiyon ve metot seriler için de geçerlidir.

In [64]:
print(pandas_series.ndim)

1

In [65]:
print(pandas_series.dtype)

int64

In [66]:
print(pandas_series.shape)

(10,)

## We can use features such as ## max(), min(), sum(), median(), mean()… in Pandas as well as in Numpy.

## max(), min(), sum(), median(), mean()… gibi özellikleri Numpy’da olduğu gibi Pandas’ta da kullanabiliyoruz.

## Pandas Dataframes are pandas multidimensional data structures. We can see this as the structure that we can most easily simulate as sql or excel tables. They consist of rows and columns like these. Dataframe structures are very useful in data analysis processes.

## Pandas Dataframe’ler pandasın çok boyutlu veri yapılarıdır. Bunu en kolay benzetebileceğimiz yapı sql veya excel tabloları gibi görebiliriz. Bunlar gibi satır ve sütunlardan oluşurlar. Dataframe yapıları veri analizi işlemlerinde oldukça faydalı olmaktadırlar.

## DataFrame
* my_dataframe = pd.DataFrame(data,index)
* Data parametresi
* Dictionary’lerden, serilerden veya listelerden oluşan bir dictionary,
* 2 boyutlu numpy dizisi,
* Başka bir DataFrame

In [67]:
#  Data dictionary'lerden oluştuğunda
dict1 = dict(a=1, b=2, c=3, d=4)
dict2 = dict(a=5, b=6, c=7, d=8, e=9)

TypeError: 'Series' object is not callable

In [ ]:
data1 = dict(first=dict1, second=dict2)
df1 = pd.DataFrame(data1)
print(df1)

In [ ]:
#Data serilerden oluştuğunda
s1 = pd.Series([1.1, 2.2, 3.3, 4.4])
s2 = pd.Series(['a', 'b', 'c', 'd', 'e'])

In [ ]:
data2 = dict(first=s1, second=s2)
df2 = pd.DataFrame(data2)
print(df2)

In [ ]:
#Data başka bir DataFrame'den oluştuğunda
df3 = pd.DataFrame(df2)
print(df3)

In [ ]:
print(pandas_series.sum())

In [ ]:
print(pandas_series.max())

In [ ]:
print(pandas_series.mean())

# SERIES

In [ ]:
labels_list = list = ["John","Jeremy","Mary","Lizz","edie"]

In [ ]:
data_list =  [10,20,30,40,50]

In [ ]:
pd.Series (data_list,labels_list)

In [ ]:
pd.Series(data_list)

In [ ]:
npArray =np.array([10,20,30,40,50])

In [ ]:
pd.Series(npArray)

In [ ]:
pd.Series(npArray,labels_list)

In [ ]:
pd.Series(data = npArray ,index =["a","b","c","d","e"])

In [ ]:
dataDict = {"John":3,"Jeremy":6,"Mary":9,"Lizz":12,"edie":15}

In [ ]:
ser2017 =pd.Series([5,10,14,20],["Wheat","Corn","Plum","Chery"])

In [ ]:
ser2017

In [ ]:
ser2018 =pd.Series([19,10,14,6],["Wheat","Corn","Strawbery","Chery"])

In [ ]:
ser2018

In [ ]:
ser2017+ser2018

In [ ]:
total =ser2017+ser2018

In [ ]:
import pandas as pd

In [ ]:
#  like np array
seri = pd.Series([1,2,3,4,5])

In [ ]:
seri

In [ ]:
type(seri)

In [ ]:
# index bilgileri
seri.axes

In [ ]:
seri.dtype

In [ ]:
seri.size

In [68]:
seri.ndim

NameError: name 'seri' is not defined

In [ ]:
# valu  sa array gibi erismek
seri.values

In [ ]:
seri.head()

In [ ]:
seri.tail()

In [ ]:
# index isimlendirmesi
pd.Series([33,44,55,66,99,77,])

In [ ]:
# index isimlendirmesini kendim yapmak istiyorum
pd.Series([33,44,55,66,99,77,],index =[1,3,5,7,9,11])

In [ ]:
# index isimlendirmesini kendim yapmak istiyorum
pd.Series([33,44,55,66,99,77,],index =['a','b','c','d','e','f'])

In [ ]:
series =pd.Series([33,44,55,66,99,77,],index =['a','b','c','d','e','f'])

In [ ]:
series['a']

In [ ]:
# slice islemi
series['a':'c']

In [ ]:
dict ={'reg':10,'log':11,'cart':12}

In [ ]:
series =pd.Series (dict)

In [ ]:
series

In [ ]:
##iki seriyi birlestirerek seri olusturma
pd.concat([series,series])

### Eleman islemleri

In [ ]:
## serilerde eleman islemleri

import numpy as np
a =np.array([1,2,3,4,5])
series= pd.Series(a)

In [ ]:
series

In [ ]:
seri[0]

In [69]:
seri[0:3]

NameError: name 'seri' is not defined

In [ ]:
seri_1= pd.Series([121,200,150,99],index= ['reg','loj','cart','rf'])

In [ ]:
seri_1

In [ ]:
seri_1.index

In [ ]:
seri_1.keys

In [ ]:
list(seri_1.items())

In [ ]:
seri_1.values

In [ ]:
# eleman sorgulama 
'reg' in seri_1

In [ ]:
'a' in seri_1

In [ ]:
seri_1['reg']

In [ ]:
# fancy eleman
seri_1[['rf','reg']]

In [ ]:
seri_1['reg'] =130

In [ ]:
seri_1['reg']

In [ ]:
seri_1 ['reg':'rf']

# Pandas dataframe olusturma

In [ ]:
import pandas as pd

In [ ]:
l =[1,2,39,67,90]

In [ ]:
l

In [ ]:
pd.DataFrame(l,columns =['variable_name'])

In [ ]:
import numpy as np
m =np.arange(1,10).reshape((3,3))

In [70]:
m

NameError: name 'm' is not defined

In [ ]:
pd.DataFrame(m,columns =['var1','var2','var3'])

In [ ]:
# df isimlendirme
df = pd.DataFrame(m,columns =['var1','var2','var3'])
df.head()

In [ ]:
df.columns

In [ ]:
df.columns =('clm1','clm2','clm3')

In [ ]:
df

In [ ]:
type(df)

In [ ]:
df.axes

In [ ]:
df.shape

In [ ]:
df.ndim

In [ ]:
df.size

In [ ]:
# convert numpy array
df.values

In [ ]:
type(df.values)

In [ ]:
df.tail()

In [ ]:
df.head()

In [ ]:
#np arrayi uzerinden df olusturmak
np_a = np.array([1,2,3,4,5,6])

In [71]:
pd.DataFrame(np_a, columns =["var_1"])

NameError: name 'np_a' is not defined

In [ ]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30,size = (5,3))
df1 =pd.DataFrame(m,columns =["var1","var2","var3"])
df1

In [ ]:
df2 = df1 +99

In [ ]:
df2

In [ ]:
?pd.concat

In [ ]:
# index problemi cozumu
pd.concat([df1,df2])

In [ ]:
pd.concat([df1,df2],ignore_index = False)

In [ ]:
# solve the index problem
pd.concat([df1,df2],ignore_index = True)

In [ ]:
df1.columns

In [ ]:
df2.columns

In [ ]:
df2.columns =["var1","var2","variable3"]

In [ ]:
df2

In [ ]:
pd.concat([df1,df2])

In [ ]:
pd.concat([df1,df2],join = "inner")

In [ ]:
pd.concat([df1,df2], join_axes = [df1.columns])

In [ ]:
df3= pd.concat([df1, df2], axis=1)
df3 = df3.reindex(df1.index)

In [ ]:
df3= pd.concat([df1, df2], axis=1)
df3 = df3.reindex(df2.index)

In [ ]:
df3

In [ ]:
df1 = pd.DataFrame({'employee name':['A','B','C','D'],
                   'group':['Accounting','Engineer','Engineer','IK']})
df1

In [ ]:
df2 = pd.DataFrame({"employee name":["A","B","C","D"],
                   ' date of work':[2010,2009,2014,2019]})
df2

In [ ]:
pd.merge(df1,df2)

In [72]:
##many to one
df3 = pd.merge(df1,df2)

NameError: name 'df1' is not defined

In [ ]:
df3

In [ ]:
df4 = df1 = pd.DataFrame({ 'group':['Accounting','Engineer','IK'],
                           'manager':['E','F','G']})
                  
df4

In [ ]:
pd.merge(df3,df4)

In [ ]:
# from many to many

df5 = pd.DataFrame({'grup':['Accounting','Accounting','Engineering','Enginieering','IK','IK'],
                   'skills' : ['math','excel','coding','java','excel','manager']})
df5

In [ ]:
df1

In [ ]:
dataset = {
           "Departmant":["Bilişim","İnsan Kaynakları","Üretim","Üretim","Bilişim","İnsan Kaynakları"],
           "Employee": ["Mustafa","Jale","Kadir","Zeynep","Murat","Ahmet"],
           "Salary":[3000,3500,2500,4500,4000,2000]
            }

In [ ]:
df =pd.DataFrame(dataset)

In [ ]:
df

In [ ]:
DepGroup = df.groupby("Departmant")

In [ ]:
DepGroup

In [ ]:
DepGroup.sum()

In [ ]:
df.groupby("Departmant").sum()

In [ ]:
df.groupby("Departmant").sum().loc["Bilişim"]

In [ ]:
int(df.groupby("Departmant").sum().loc["Bilişim"])

In [ ]:
df.groupby("Departmant").count()

In [ ]:
df.groupby("Departmant").max()

In [ ]:
df.groupby("Departmant").min()

In [ ]:
df.groupby("Departmant").min()["Salary"]

In [ ]:
df.groupby("Departmant").min()["Salary"]["Bilişim"]

In [ ]:
df.groupby("Departmant").mean()

In [ ]:
df.groupby("Departmant").mean()["Salary"]

In [73]:
df.groupby("Departmant").mean()["Salary"]["İnsan Kaynakları"]

NameError: name 'df' is not defined

## Filter

In [ ]:
df = pd.DataFrame({'groups':['a','b','c','a','b','c'],
                 'variable_1': [1,2,3,4,5,6],
                  'variable_2': [10,11,12,13,14,15]},
                  columns = ['groups','variable_1','variable_2'])
df

In [ ]:
# std() standart sapma

def filter_func(x):
    return x ['variable_1'].std()>9

In [ ]:
df.groupby('groups').std()

In [ ]:
df.groupby('groups').filter(filter_func)

In [ ]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [ ]:
df =pd.DataFrame(randn(4,3),["a","s","d","f"],["clm1","clm2","clm3"])

In [ ]:
df

In [ ]:
df>-1

In [ ]:
df>0

In [ ]:
booleanDf = df> 0

In [ ]:
booleanDf

In [ ]:
df[booleanDf]

In [ ]:
df[df>0]

In [ ]:
df[df >-2]

In [ ]:
df

In [ ]:
df["clm1"]

In [ ]:
df["clm1"]>0

In [ ]:
df["clm1"]>0.5

In [ ]:
df[df["clm1"]>0.5]

In [ ]:
df[df["clm2"]>0]

In [ ]:
df[df["clm2"]>0.5]

In [ ]:
df[(df["clm1"]>0)&(df["clm2"]>0)]

In [ ]:
df[(df["clm1"]>0)|(df["clm2"]>0)]

In [ ]:
df

In [74]:
df["clm4"] = pd.Series(randn(4),["a","s","d","f"])

NameError: name 'randn' is not defined

In [ ]:
df

In [ ]:
df ["clm5"] =randn(4)

In [ ]:
df

In [ ]:
df["clm6"] = ["newValue1","newValue2","newValue3","newValue4"]

In [ ]:
df

In [ ]:
df.set_index("clm6")

In [ ]:
df

In [ ]:
df.set_index("clm6",inplace = True)

In [ ]:
df

In [ ]:
df.index.names

##  Multiindex

In [ ]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [ ]:
outer_Index = ["Group1","Group1","Group1","Group2","Group2","Group2","Group3","Group3","Group3"]

In [ ]:
inner_Index = ["Index1","Index2","Index3","Index1","Index2","Index3","Index1","Index2","Index3"]

In [ ]:
zip(outer_Index,inner_Index)

In [ ]:
list(zip(outer_Index,inner_Index))

In [ ]:
hierarchy = list(zip(outer_Index,inner_Index))

In [ ]:
hierarchy = pd.MultiIndex.from_tuples(hierarchy)

In [ ]:
# there is a problem
hierarchy

In [ ]:
df =pd.DataFrame(randn(9,3),hierarchy,columns = ["clm1","clm2","clm3"])

In [ ]:
df

In [ ]:
df["clm1"]

In [ ]:
df.loc["newValue1"]

In [ ]:
df.loc["Group1"].loc["Index1"]

In [75]:
df.loc["Group1"].loc["Index1"]["clm1"]

NameError: name 'df' is not defined

In [ ]:
df

In [ ]:
df.index.names

In [ ]:
df.index.names = ["Groups"]

In [ ]:
df

In [ ]:
df.loc["newValue1"]

In [ ]:
df.xs("newValue1")

In [ ]:
df.xs("newValue2")

In [ ]:
df.xs("newValue2").xs("clm2")

In [ ]:
df.xs("newValue3").xs("clm3")

In [ ]:
df.xs("cmd1", level = "Indexes")

## Datai Team

In [ ]:
import pandas as pd

In [ ]:
dictionary = {"NAME":['a','b','c','d','e','f'],
              "AGE":[15,16,17,18,19,20],
              "SALARY":[2,4,6,8,10,12]}

In [ ]:
dictionary

In [ ]:
df_1 =pd.DataFrame(dictionary)

In [ ]:
df_1

In [ ]:
df_1.head()

In [ ]:
df_1.tail()

## pandas Basic methods

In [ ]:
df_1.columns

In [76]:
df_1.info()

NameError: name 'df_1' is not defined

In [ ]:
print(df_1.dtypes)

In [ ]:
#  numeric features = columns

print(df_1.describe())

In [ ]:
dataFrame1 = pd.DataFrame(dictionary)

In [ ]:
print(dataFrame1["AGE"])
print(dataFrame1.AGE)

In [ ]:
dataFrame1["yeni feature"] = [-1,-2,-3,-4,-5,-6]

print(dataFrame1.loc[:, "AGE"])

print(dataFrame1.loc[:3, "AGE"])

print(dataFrame1.loc[:3, "AGE":"NAME"])

print(dataFrame1.loc[:3, ["AGE","NAME"]])

print(dataFrame1.loc[::-1,:])

print(dataFrame1.loc[:,:"NAME"])

print(dataFrame1.loc[:,"NAME"])

print(dataFrame1.iloc[:,2])

In [ ]:
# %% filtering

filtre1 = dataFrame1.MAAS > 200

filtrelenmis_data = dataFrame1[filtre1]

filtre2 = dataFrame1.AGE <20

dataFrame1[filtre1 & filtre2]

print(dataFrame1[dataFrame1.AGE > 60])

## Indexing and Slicing
### 3 ways of slicing

### 1.Way  []

In [ ]:
df_1["NAME"]

In [ ]:
df_1.AGE

In [ ]:
df_1[0:2]

## how to add new feature

In [ ]:
df_1["NEW_FEATURE"] =[-1,-2,-3,-4,-5,-6]

In [ ]:
df_1.NEW_FEATURE

###    2.Way .loc

In [ ]:
# tum satirlar
print(df_1.loc[:,"AGE"])

In [ ]:
# pandas  3. index dahil ama eski  numpy ve listede  dahil degildi.
print(df_1.loc[:3,"AGE"])

In [ ]:
print(df_1.loc[:3,"AGE":"NAME"])

In [ ]:
print(df_1.loc[:3,["AGE","NAME"]])

In [ ]:
print(df_1.loc[::-1,:])

In [ ]:
print(df_1.loc[:,:"NAME"])

In [77]:
?np.random .randint

Object `np.random .randint` not found.

In [78]:
import numpy as np
import pandas as pd

In [79]:
m = np.random .randint(1,30 ,size = (10,3))

In [80]:
m

array([[ 1, 13,  7],
       [10, 23, 22],
       [17, 24, 29],
       [18, 28,  7],
       [ 7, 18,  4],
       [23,  5, 15],
       [ 9, 20, 15],
       [ 8,  3, 20],
       [23,  1, 20],
       [ 8, 13, 13]])

In [81]:
df =pd.DataFrame(m,columns = ["var1","var2","var3"])

In [82]:
df

   var1  var2  var3
0     1    13     7
1    10    23    22
2    17    24    29
3    18    28     7
4     7    18     4
5    23     5    15
6     9    20    15
7     8     3    20
8    23     1    20
9     8    13    13

# loc :tanimlandigi sekli ile secim yapmak icin kullanilir

In [83]:
df.loc[0:3]

   var1  var2  var3
0     1    13     7
1    10    23    22
2    17    24    29
3    18    28     7

In [84]:
# iloc : alisik oldugumuz indexleme mantigi ile secim yapar
df.iloc[0:3]

   var1  var2  var3
0     1    13     7
1    10    23    22
2    17    24    29

In [85]:
df.iloc[0,0]

1

In [86]:
df

   var1  var2  var3
0     1    13     7
1    10    23    22
2    17    24    29
3    18    28     7
4     7    18     4
5    23     5    15
6     9    20    15
7     8     3    20
8    23     1    20
9     8    13    13

In [87]:
df.iloc[:3,:2]

   var1  var2
0     1    13
1    10    23
2    17    24

In [88]:
df.loc[0:3,"var3"]

0     7
1    22
2    29
3     7
Name: var3, dtype: int32

In [89]:
df.iloc[0:3,"var3"]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [ ]:
df.iloc[0:3]["var3"]

In [ ]:
df[0:2]["var1","var2"]

In [ ]:
df[0:2][["var1","var2"]]

In [ ]:
df.var1

In [ ]:
df[df.var1>20]

In [ ]:
df[(df.var1>20) &(df.var3<5)]

In [ ]:
df[(df.var1>20),["var1","var2"]]

In [ ]:
df.loc[(df.var1>20),["var1","var2"]]

## loc -> location    iloc -> intlocation 
- loc  ("String") alir
- iloc (index alir)

In [ ]:
print(df_1.iloc[:,2])

In [ ]:
print(df_1.iloc[:,0])

In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [ ]:
from numpy.random import randn

In [ ]:
randn(3,3)

In [ ]:
df = pd.DataFrame(data =randn(3,3),index =["A","B","C"],columns = ["Clm1","Clm2","Clm3"])

In [ ]:
df

## choose clm1

In [ ]:
df["Clm1"]

In [ ]:
df["Clm3"]

In [ ]:
type(df["Clm1"])

## Choose row  or index

In [ ]:
df.loc["A"]

In [ ]:
df.loc["C"]

In [ ]:
df[["Clm1","Clm3"]]

In [ ]:
df

In [ ]:
df["Clm4"] = pd.Series(randn(3),["A","B","C"])

In [ ]:
df["Clm5"] =df["Clm1"]+df["Clm2"]+df["Clm3"]+df["Clm4"]

In [ ]:
df

In [ ]:
df.drop("Clm5",1)

In [ ]:
df

In [ ]:
df.drop("Clm5",1,inplace =True)

In [ ]:
df

In [ ]:
df["Clm1"]

In [ ]:
df.loc["B"]

In [ ]:
df.iloc[0]

In [ ]:
df.loc["A","Clm1"]

In [ ]:
df.loc[["A","B"],["Clm1","Clm2"]]

## DataFrame Operasyonlari

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.DataFrame({
    "clm1":[1,2,3,4,5,6],
    "clm2":[100,100,200,300,300,100],
    "clm3":["Mustafa","Kamil","Emre","Murat","Ayse","Zeynep"]
})

In [ ]:
df

In [ ]:
df.head(3)

In [ ]:
df["clm2"].unique()

In [ ]:
df["clm2"].nunique()

In [ ]:
df["clm2"].value_counts()

In [ ]:
df[df["clm1"] >=4]

In [ ]:
df[(df["clm1"] >=4) &( df["clm2"] ==300) ]

In [ ]:
df

In [ ]:
def time3(x):
    return x *3

In [90]:
time3(6)

NameError: name 'time3' is not defined

In [ ]:
df["clm2"].apply(time3)

In [ ]:
df

In [ ]:
 datalambda =lambda  x : x*2

In [ ]:
datalambda(4)

In [ ]:
df["clm2"].apply(lambda x : x*2)

In [ ]:
df["clm3"].apply(len)

In [ ]:
#delete to column
df.drop("clm3",axis =1)

In [ ]:
df.drop("clm3",axis =1 ,inplace =True)

In [ ]:
df

In [ ]:
df.columns

In [ ]:
df.index

In [ ]:
len(df.index)

In [ ]:
df.index.names

In [ ]:
df

In [ ]:
df.sort_values("clm2",ascending=False)

In [ ]:
df = pd.DataFrame({
    "Ay" : ["Mart","Nisan","Mayıs","Mart","Nisan","Mayıs","Mart","Nisan","Mayıs"],
    "Şehir":["Ankara","Ankara","Ankara","İstanbul","İstanbul","İstanbul","İzmir","İzmir","İzmir"],
    "Nem":[10,25,50,21,67,80,30,70,75]
})

In [ ]:
df

In [ ]:
df.pivot_table(index = "Şehir",columns ="Ay",values = "Nem")

In [ ]:
df.pivot_table(index = "Ay",columns ="Şehir",values = "Nem")

In [ ]:
df

## Concatenate/Join/Merge

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
dataset1 = {
    "A": ["A1","A2","A3","A4"],
    "B":["B1","B2","B3","B4"],
    "C":["C1","C2","C3","C4"],
}

In [ ]:
dataset2 = {
    "A": ["A5","A6","A7","A8"],
    "B":["B5","B6","B7","B8"],
    "C":["C5","C6","C7","C8"],
}

In [ ]:
df1 = pd.DataFrame(dataset1,index = [1,2,3,4])
df2 = pd.DataFrame(dataset2,index = [5,6,7,8] )

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.concat([df1,df2])

In [ ]:
pd.concat([df1,df2],axis =1)

### Join

In [ ]:
dataset1 = {
    "A" : ["A1","A2","A3","A4"],
    "B" : ["B1","B2","B3","A4"],
}
dataset2 = {
    "X" : ["X1","X2","X3"],
    "Y" : ["Y1","Y2","Y3"],
    
}

In [91]:
df1 = pd.DataFrame(dataset1,index = [1,2,3,4]) 
df2 = pd.DataFrame(dataset2,index = [1,2,3])

NameError: name 'dataset1' is not defined

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1.join(df2)

In [ ]:
df2.join(df1)

## Merge

In [ ]:
dataset1 = {
    "A" : ["A1","A2","A3"],
    "B" : ["B1","B2","B3"],
    "anahtar" : ["K1","K2","K3"]
}

In [ ]:
df1 = pd.DataFrame(dataset1,index = [1,2,3])

In [ ]:
df1

In [ ]:
dataset2 = {
    "X" : ["X1","X2","X3","X4"],
    "Y" : ["Y1","Y2","Y3","Y4"],
    "anahtar" : ["K1","K2","K5","K4"]
}

In [ ]:
df2 = pd.DataFrame(dataset2,index = [1,2,3,4])

In [ ]:
df2

In [ ]:
pd.merge(df1,df2,how ="inner",on = "anahtar")

## İleri Birleştirme İşlemleri

### birebir birlestirme

In [ ]:
import pandas as pd

df1 = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                        'grup': ['Muhasebe', 'Muhendislik', 'Muhendislik', 'İK']})

df1

In [ ]:
df2 = pd.DataFrame({'calisanlar': ['Ayse', 'Ali', 'Veli', 'Fatma'],
                        'ilk_giris': [2010, 2009, 2014, 2019]})

df2

In [ ]:
## birebir birlestirme   


pd.merge(df1,df2)

In [ ]:
pd.merge(df1,df2, on = 'calisanlar')

In [ ]:
# coktan teke   // many to one   //

## Pandas Foundation

* single column series
* NaN =not a number
* dataframe.values = numpy


## BUILDING DATA FRAMES FROM SCRATCH
* We can build data frames from csv as we did earlier.
* Also we can build dataframe from dictionaries
* zip() method: This function returns a list of tuples, where the i-th tuple contains the i-th element from each of the argument sequences or iterables.
* Adding new column
* Broadcasting: Create new column and assign a value to entire column

In [ ]:
# data frames from dictionary
country = ["Spain","France"]
population = ["11","12"]
list_label = ["country","population"]
list_col = [country,population]
zipped = list(zip(list_label,list_col))
data_dict = dict(zipped)
import pandas as pd
df = pd.DataFrame(data_dict)
df

In [ ]:
# Add new columns
df["capital"] = ["madrid","paris"]
df

In [ ]:
# Broadcasting
df["income"] = 0 #Broadcasting entire column
df

In [ ]:
## INDEXING PANDAS TIME SERIES
## datetime = object
## parse_dates(boolean): Transform date to ISO 8601 (yyyy-mm-dd hh:mm:ss ) format

In [ ]:
time_list = ["1992-03-08","1992-04-12"]
print(type(time_list[1])) # As you can see date is string
# however we want it to be datetime object
datetime_object = pd.to_datetime(time_list)
print(type(datetime_object))

In [ ]:
# close warning
import warnings
warnings.filterwarnings("ignore")
# In order to practice lets take head of pokemon data and add it a time list
data2 = data.head()
date_list = ["1992-01-10","1992-02-10","1992-03-10","1993-03-15","1993-03-16"]
datetime_object = pd.to_datetime(date_list)
data2["date"] = datetime_object
# lets make date as index
data2= data2.set_index("date")
data2

In [ ]:
# Now we can select according to our date index
print(data2.loc["1993-03-16"])
print(data2.loc["1992-03-10":"1993-03-16"])

## RESAMPLING PANDAS TIME SERIES
* Resampling: statistical method over different time intervals
* Needs string to specify frequency like "M" = month or "A" = year
* Downsampling: reduce date time rows to slower frequency like from daily to weekly
* Upsampling: increase date time rows to faster frequency like from daily to hourly
* Interpolate: Interpolate values according to different methods like ‘linear’, ‘time’ or index’
https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.interpolate.html

In [92]:
# We will use data2 that we create at previous part
data2.resample("A").mean()

NameError: name 'data2' is not defined

In [ ]:
# Lets resample with month
data2.resample("M").mean()
# As you can see there are a lot of nan because data2 does not include all months

In [ ]:
# In real life (data is real. Not created from us like data2) we can solve this problem with interpolate
# We can interpolete from first value
data2.resample("M").first().interpolate("linear")

In [ ]:
# Or we can interpolate with mean()
data2.resample("M").mean().interpolate("linear")

## INDEXING DATA FRAMES
* Indexing using square brackets
* Using column attribute and row label
* Using loc accessor
* Selecting only some columns

In [ ]:
# read data
data = pd.read_csv('../input/pokemon.csv')
data= data.set_index("#")
data.head()

In [ ]:
# indexing using square brackets
data["HP"][1]

In [ ]:
# using column attribute and row label
data.HP[1]

In [ ]:
# using loc accessor
data.loc[1,["HP"]]

In [ ]:
# Selecting only some columns
data[["HP","Attack"]]

## SLICING DATA FRAME
* Difference between selecting columns
* Series and data frames
* Slicing and indexing series
* Reverse slicing
* From something to end

In [ ]:
# Difference between selecting columns: series and dataframes
print(type(data["HP"]))     # series
print(type(data[["HP"]]))   # data frames

In [ ]:
# Slicing and indexing series
data.loc[1:10,"HP":"Defense"]   # 10 and "Defense" are inclusive

In [ ]:
# Reverse slicing 
data.loc[10:1:-1,"HP":"Defense"]

In [ ]:
# From something to end
data.loc[1:10,"Speed":]

## FILTERING DATA FRAMES
* Creating boolean series Combining filters Filtering column based others

In [128]:
import pandas as pd
df = pd.DataFrame({'groups':['A','B','C','A','B','C'],
                  'var1':[10,11,52,23,43,55],
                  'var2' :[10,111,222,333,444,555]},
                  columns=['groups' , 'var1'  , 'var2'])
df

  groups  var1  var2
0      A    10    10
1      B    11   111
2      C    52   222
3      A    23   333
4      B    43   444
5      C    55   555

In [129]:
def filter_func(x):
    return x["var1"].std() > 9

In [130]:
df.groupby("groups").filter(filter_func)

  groups  var1  var2
0      A    10    10
1      B    11   111
3      A    23   333
4      B    43   444

## Transform

In [ ]:
import pandas as pd
df = pd.DataFrame({'groups':['A','B','C','A','B','C'],
                  'var1':[10,23,33,23,11,99],
                  'var2' :[100,253,111,333,444,969]},
                  columns=['groups' , 'var1'  , 'var2'])
df

In [ ]:
# tum gozlemleri sec:then   iloc: sutuna bagli      loc:satura bagli  categoric sutunu cikardim
df_numeric= df.iloc [:,1:3]

In [ ]:
df_numeric.transform(lambda x: x-x.mean())

In [ ]:
#transform fonksiyonu vectorel bazda calisiyor...sutun bazinda degiskenler uzerinde islem yapabiliyoruz

df_numeric.transform(lambda x:(x-x.mean())/x.std ())

## Apply

In [ ]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
                  'var1':[10,23,33,23,11,99],
                  'var2' :[100,253,111,333,444,969]},
                  columns=[ 'var1'  , 'var2'])
df

In [ ]:
df.apply(np.sum)

In [ ]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'groups':['A','B','C','A','B','C'],
                  'var1':[10,23,33,23,11,99],
                  'var2' :[100,253,111,333,444,969]},
                  columns=['groups' , 'var1'  , 'var2'])
df

In [ ]:
df.apply(np.sum)

In [ ]:
df.groupby("groups").apply(np.sum)

# Pivot Tables
* Multidimensional version of Groupby

In [1]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

*  pivot with groupby
*  what will you do .....groupby
*  according to which variable will you do it .....sex
*  which is a continuous variable.......survived
*  what will you do next ...mean

*  groupby ile pivot
*  ne yapacaksin   .....groupby
*  hangi degiskene gore yapacaksin .....sex
*  surekli degisken hangisi.......survived
*  bundan sonra ne yapacaksin  ...mean

In [2]:
# categoric variable, continues variable
titanic.groupby("sex")['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [3]:
# categoric variable, continues variable
# converting the above process to a pivot table
titanic.groupby("sex")[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [5]:
# groupby ile pivot table olusturduk.
# Genisletelim
titanic.groupby(["sex",'class'])[['survived']].aggregate('mean').unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [6]:
# groupby ile pivot table olusturduk.
# Genisletelim
# without unstack()
titanic.groupby(["sex",'class'])[['survived']].aggregate('mean')

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

### pivot table  with pivot

In [9]:

# odaklandigin degisken
# index i nedir   ..satirlar 
# baska hangi degisken
titanic.pivot_table("survived",index="sex",columns ='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [10]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [ ]:
# cok boyutlu pivot

In [14]:
 # neyi keseyim/  age i/su araliklarla
age =pd.cut(titanic['age'],[0,18,50,90])
age.head(10)

0    (18.0, 50.0]
1    (18.0, 50.0]
2    (18.0, 50.0]
3    (18.0, 50.0]
4    (18.0, 50.0]
5             NaN
6    (50.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 50.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (3, interval[int64]): [(0, 18] < (18, 50] < (50, 90]]

In [15]:
titanic.pivot_table('survived',['sex',age],'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 50]  0.967213  0.912281  0.413793
       (50, 90]  1.000000  0.666667  1.000000
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 50]  0.442857  0.069444  0.139896
       (50, 90]  0.192308  0.083333  0.000000

## csv  formu okuma

In [93]:
import pandas as pd

In [94]:
?pd.read_csv

In [ ]:
pd.read_csv("ornekcsv.csv",sep =";")

In [ ]:
#txt okuma
pd.read_csv("duz_metin.txt" )

In [ ]:
pd.read_excel("ornekx.xlsx" )

In [ ]:
df=pd.read_excel("ornekx.xlsx" )

In [ ]:
type(df)

In [ ]:
df.head()

In [ ]:
df.columns=("A","B","C")

In [ ]:
df

In [ ]:
# sifirdan dan txt okuma
tips =pd.read_csv("data.txt" )

## (Aggragation&Grouping)

### Basit toplulastirma fonksiyonlari
* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

## Toplulastirma

In [96]:
import seaborn as sns

In [ ]:
    ?sns.load_dataset

In [97]:
df= sns.load_dataset("planets")

In [98]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [99]:
# row ,column
df.shape

(1035, 6)

In [100]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [101]:
# tum data frame ile ilgili islemler

df.mean().T

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [102]:
# belli bir atribiutle

In [103]:
df['mass'].mean()

2.6381605847953233

In [104]:
df['mass'].count()

513

In [105]:
df['mass'].median()

1.26

In [106]:
df['mass'].min()

0.0036

In [107]:
df['mass'].max()

25.0

In [108]:
df.std()

number                1.240976
orbital_period    26014.728304
mass                  3.818617
distance            733.116493
year                  3.972567
dtype: float64

In [109]:
df['mass'].std()

3.8186166509616046

In [110]:
df.var()

number            1.540022e+00
orbital_period    6.767661e+08
mass              1.458183e+01
distance          5.374598e+05
year              1.578129e+01
dtype: float64

In [111]:
df['mass'].var()

14.58183312700122

In [112]:
## tum degiskenleri betimsel istatistikler  bulabiliriz
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [113]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [114]:
## betimsel istatistikler ..eksik gozlemleri sildi.
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Gruplama

In [124]:
import pandas as pd
df = pd.DataFrame({'groups':['A','B','C','A','B','C'],
                  'data1':[10,23,33,23,11,99]},
                  
                  columns=['groups' , 'data1'])
df

  groups  data1
0      A     10
1      B     23
2      C     33
3      A     23
4      B     11
5      C     99

In [125]:
## gruplari yakaladik. ne yapmak istiyorsun diye soruyor
df.groupby("groups")

In [126]:
## ortalamsini almak istiyorum diyorum.
## gruplastirma ile toplulastirma islemleri birara dayapilir (aggregation)
df.groupby("groups").mean()

        data1
groups
A        16.5
B        17.0
C        66.0

In [127]:
df.groupby("groups").sum()

        data1
groups
A          33
B          34
C         132

In [ ]:
import pandas as pd
df = pd.DataFrame({'groups':['A','B','C','A','B','C'],
                  'var1':[10,23,33,23,11,99],
                  'var2' :[100,253,111,333,444,969]},
                  columns=['groups' , 'var1'  , 'var2'])
df

In [116]:
df= sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [117]:
df.groupby("method")

In [121]:
# method Categoric variable
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [122]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [123]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

# Aggregate

In [131]:
import pandas as pd
df = pd.DataFrame({'groups':['A','B','C','A','B','C'],
                  'var1':[10,11,52,23,43,55],
                  'var2' :[10,111,222,333,444,555]},
                  columns=['groups' , 'var1'  , 'var2'])
df

  groups  var1  var2
0      A    10    10
1      B    11   111
2      C    52   222
3      A    23   333
4      B    43   444
5      C    55   555

In [ ]:
# aggregate

In [132]:
df.groupby("groups").mean()

        var1   var2
groups
A       16.5  171.5
B       27.0  277.5
C       53.5  388.5

In [133]:
# 

df.groupby("groups").aggregate(['min',np.median,max])

       var1            var2
        min median max  min median  max
groups
A        10   16.5  23   10  171.5  333
B        11   27.0  43  111  277.5  444
C        52   53.5  55  222  388.5  555

In [134]:
df.groupby("groups").aggregate({'var1':'min','var2':'max'})

        var1  var2
groups
A         10   333
B         11   444
C         52   555